In [3]:
import pandas as pd
from pandas import DataFrame, read_csv
import numpy as np
#1
# read csv_sample1.csv using read_csv function and store in df1
#2
# read  csv_sample1.csv using read_table function and store in df2
#3
# read csv_sample2.csv using read_csv without header and store in df3
#4
"""
read csv_sample2.csv in df4
rename the columns as "new_col1", "new_col2", "new_col3", "new_col4" and "new_value"
assign new_value column as index
"""
#5
# read space_sep.txt using read_table and store in df5
#6 
# read skip_row.csv using read_csv while skipping the rows 0, 2, 3 and 6
#7
# read null_data.csv in df7. Drop the rows with null values. store the resulting data frame in df8
#8
# fill the null values in df7 using with 1000 and name the new data frame df8
#9
# use forward to fill the null values in df7 data frame 
#10
# df9 = pd.DataFrame({'col1':[1,2,np.nan,4,5], 'col2':[9,np.nan,7,6,5]})
# fill the nan values of df9 with mean of column

'\nread csv_sample2.csv in df4\nrename the columns as "new_col1", "new_col2", "new_col3", "new_col4" and "new_value"\nassign new_value column as index\n'

In [2]:
loc=r'C:\Users\NOOR\data'

In [4]:
location=r'C:\Users\NOOR\data\csv_sample1.csv'
df1=pd.read_csv(location)

In [5]:
df1[:10]

   col1  col2  col3  col4    value
0     1     2     3     4  reading
1     5     6     7     8      csv
2     9    10    11    12     file

In [6]:
df1

   col1  col2  col3  col4    value
0     1     2     3     4  reading
1     5     6     7     8      csv
2     9    10    11    12     file

In [7]:
location=r'C:\Users\NOOR\data\csv_sample2.csv'
df2=pd.read_csv(location)

In [8]:
df2

   1   2   3   4 reading
0  5   6   7   8     csv
1  9  10  11  12    file

In [9]:
location=r'C:\Users\NOOR\data\csv_sample2.csv'
df3=pd.read_csv(location)

In [10]:
df3

   1   2   3   4 reading
0  5   6   7   8     csv
1  9  10  11  12    file

In [16]:
location=r'C:\Users\NOOR\data\csv_sample2.csv'
df4=pd.read_csv(location,names=['new_col1', 'new_col2', 'new_col3', 'new_col4','new_value'],index_col='new_value')

In [18]:
df4

           new_col1  new_col2  new_col3  new_col4
new_value
reading           1         2         3         4
csv               5         6         7         8
file              9        10        11        12

In [19]:
from pandas import read_table

In [20]:
loc=r'C:\Users\NOOR\data\space_sep.txt'
df5=read_table(loc)

In [21]:
df5

              col1         col2         col3
0         row1 -0.264438 -1.026059 -0.619500
1         row2  0.927272  0.302904 -0.032399
2         row3 -0.264273 -0.386314 -0.217601
3         row4 -0.871858 -0.348382  1.100491

In [37]:
location=r'C:\Users\NOOR\data\skip_row.csv'
df6=pd.read_csv(location,index_col=None)
df6

                                                      # This is some random comment
col1                                   col2 col3 col4                         value
# unwanted comment needs to be removed NaN  NaN  NaN                            NaN
# Remove this one too                  NaN  NaN  NaN                            NaN
1                                      2    3    4                              YOU
5                                      6    7    8                              DID
# and if possible remove me too!!      NaN  NaN  NaN                            NaN
9                                      10   11   12                              IT

In [61]:
df6=read_csv(location,index_col=None,skiprows=[0,2,3,6])
df6

   col1  col2  col3  col4 value
0     1     2     3     4   YOU
1     5     6     7     8   DID
2     9    10    11    12    IT

In [65]:
loc=r'C:\Users\NOOR\data\null_data.csv'
df7=read_csv(loc)
df7

      some   a   b     c    d   random
0  message   1   2   3.0    4      NaN
1       is   5   6   NaN    8  written
2     here   9  10  11.0   12       NO
3      but  13  14  15.0  YES      NaN

In [67]:
loc=r'C:\Users\NOOR\data\null_data.csv'
df8=df7.dropna()
df8

   some  a   b     c   d random
2  here  9  10  11.0  12     NO

In [73]:
df7

      some   a   b     c    d   random
0  message   1   2   3.0    4      NaN
1       is   5   6   NaN    8  written
2     here   9  10  11.0   12       NO
3      but  13  14  15.0  YES      NaN

In [70]:
df8=df7.fillna(1000)
df8

      some   a   b       c    d   random
0  message   1   2     3.0    4     1000
1       is   5   6  1000.0    8  written
2     here   9  10    11.0   12       NO
3      but  13  14    15.0  YES     1000

In [74]:
df8_1=df7.fillna(method='ffill')
df8_1

      some   a   b     c    d   random
0  message   1   2   3.0    4      NaN
1       is   5   6   3.0    8  written
2     here   9  10  11.0   12       NO
3      but  13  14  15.0  YES       NO

In [75]:
df9 = pd.DataFrame({'col1':[1,2,np.nan,4,5], 'col2':[9,np.nan,7,6,5]})
df9

   col1  col2
0   1.0   9.0
1   2.0   NaN
2   NaN   7.0
3   4.0   6.0
4   5.0   5.0

In [81]:
df9.col2.mean()

6.75

In [99]:
df9.col1.fillna(df9.col1.mean(),inplace=True)

In [100]:
df9.col2.fillna(df9.col2.mean(),inplace=True)

In [101]:
df9

   col1  col2
0   1.0  9.00
1   2.0  6.75
2   3.0  7.00
3   4.0  6.00
4   5.0  5.00